espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/hp_peri_pms_eco5_reg.h
/** TEE_CORE1_MM_PMS_REG2_REG register
 *  NA
 */
#define TEE_CORE1_MM_PMS_REG2_REG (DR_REG_TEE_BASE + 0x30)
/** TEE_REG_CORE1_MM_HP_MCPWM0_ALLOW : R/W; bitpos: [0]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_MCPWM0_ALLOW    (BIT(0))
#define TEE_REG_CORE1_MM_HP_MCPWM0_ALLOW_M  (TEE_REG_CORE1_MM_HP_MCPWM0_ALLOW_V << TEE_REG_CORE1_MM_HP_MCPWM0_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_MCPWM0_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_MCPWM0_ALLOW_S  0
/** TEE_REG_CORE1_MM_HP_MCPWM1_ALLOW : R/W; bitpos: [1]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_MCPWM1_ALLOW    (BIT(1))
#define TEE_REG_CORE1_MM_HP_MCPWM1_ALLOW_M  (TEE_REG_CORE1_MM_HP_MCPWM1_ALLOW_V << TEE_REG_CORE1_MM_HP_MCPWM1_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_MCPWM1_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_MCPWM1_ALLOW_S  1
/** TEE_REG_CORE1_MM_HP_TIMER_GROUP0_ALLOW : R/W; bitpos: [2]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_TIMER_GROUP0_ALLOW    (BIT(2))
#define TEE_REG_CORE1_MM_HP_TIMER_GROUP0_ALLOW_M  (TEE_REG_CORE1_MM_HP_TIMER_GROUP0_ALLOW_V << TEE_REG_CORE1_MM_HP_TIMER_GROUP0_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_TIMER_GROUP0_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_TIMER_GROUP0_ALLOW_S  2
/** TEE_REG_CORE1_MM_HP_TIMER_GROUP1_ALLOW : R/W; bitpos: [3]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_TIMER_GROUP1_ALLOW    (BIT(3))
#define TEE_REG_CORE1_MM_HP_TIMER_GROUP1_ALLOW_M  (TEE_REG_CORE1_MM_HP_TIMER_GROUP1_ALLOW_V << TEE_REG_CORE1_MM_HP_TIMER_GROUP1_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_TIMER_GROUP1_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_TIMER_GROUP1_ALLOW_S  3
/** TEE_REG_CORE1_MM_HP_I2C0_ALLOW : R/W; bitpos: [4]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_I2C0_ALLOW    (BIT(4))
#define TEE_REG_CORE1_MM_HP_I2C0_ALLOW_M  (TEE_REG_CORE1_MM_HP_I2C0_ALLOW_V << TEE_REG_CORE1_MM_HP_I2C0_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_I2C0_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_I2C0_ALLOW_S  4
/** TEE_REG_CORE1_MM_HP_I2C1_ALLOW : R/W; bitpos: [5]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_I2C1_ALLOW    (BIT(5))
#define TEE_REG_CORE1_MM_HP_I2C1_ALLOW_M  (TEE_REG_CORE1_MM_HP_I2C1_ALLOW_V << TEE_REG_CORE1_MM_HP_I2C1_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_I2C1_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_I2C1_ALLOW_S  5
/** TEE_REG_CORE1_MM_HP_I2S0_ALLOW : R/W; bitpos: [6]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_I2S0_ALLOW    (BIT(6))
#define TEE_REG_CORE1_MM_HP_I2S0_ALLOW_M  (TEE_REG_CORE1_MM_HP_I2S0_ALLOW_V << TEE_REG_CORE1_MM_HP_I2S0_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_I2S0_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_I2S0_ALLOW_S  6
/** TEE_REG_CORE1_MM_HP_I2S1_ALLOW : R/W; bitpos: [7]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_I2S1_ALLOW    (BIT(7))
#define TEE_REG_CORE1_MM_HP_I2S1_ALLOW_M  (TEE_REG_CORE1_MM_HP_I2S1_ALLOW_V << TEE_REG_CORE1_MM_HP_I2S1_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_I2S1_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_I2S1_ALLOW_S  7
/** TEE_REG_CORE1_MM_HP_I2S2_ALLOW : R/W; bitpos: [8]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_I2S2_ALLOW    (BIT(8))
#define TEE_REG_CORE1_MM_HP_I2S2_ALLOW_M  (TEE_REG_CORE1_MM_HP_I2S2_ALLOW_V << TEE_REG_CORE1_MM_HP_I2S2_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_I2S2_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_I2S2_ALLOW_S  8
/** TEE_REG_CORE1_MM_HP_PCNT_ALLOW : R/W; bitpos: [9]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_PCNT_ALLOW    (BIT(9))
#define TEE_REG_CORE1_MM_HP_PCNT_ALLOW_M  (TEE_REG_CORE1_MM_HP_PCNT_ALLOW_V << TEE_REG_CORE1_MM_HP_PCNT_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_PCNT_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_PCNT_ALLOW_S  9
/** TEE_REG_CORE1_MM_HP_UART0_ALLOW : R/W; bitpos: [10]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_UART0_ALLOW    (BIT(10))
#define TEE_REG_CORE1_MM_HP_UART0_ALLOW_M  (TEE_REG_CORE1_MM_HP_UART0_ALLOW_V << TEE_REG_CORE1_MM_HP_UART0_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_UART0_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_UART0_ALLOW_S  10
/** TEE_REG_CORE1_MM_HP_UART1_ALLOW : R/W; bitpos: [11]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_UART1_ALLOW    (BIT(11))
#define TEE_REG_CORE1_MM_HP_UART1_ALLOW_M  (TEE_REG_CORE1_MM_HP_UART1_ALLOW_V << TEE_REG_CORE1_MM_HP_UART1_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_UART1_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_UART1_ALLOW_S  11
/** TEE_REG_CORE1_MM_HP_UART2_ALLOW : R/W; bitpos: [12]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_UART2_ALLOW    (BIT(12))
#define TEE_REG_CORE1_MM_HP_UART2_ALLOW_M  (TEE_REG_CORE1_MM_HP_UART2_ALLOW_V << TEE_REG_CORE1_MM_HP_UART2_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_UART2_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_UART2_ALLOW_S  12
/** TEE_REG_CORE1_MM_HP_UART3_ALLOW : R/W; bitpos: [13]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_UART3_ALLOW    (BIT(13))
#define TEE_REG_CORE1_MM_HP_UART3_ALLOW_M  (TEE_REG_CORE1_MM_HP_UART3_ALLOW_V << TEE_REG_CORE1_MM_HP_UART3_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_UART3_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_UART3_ALLOW_S  13
/** TEE_REG_CORE1_MM_HP_UART4_ALLOW : R/W; bitpos: [14]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_UART4_ALLOW    (BIT(14))
#define TEE_REG_CORE1_MM_HP_UART4_ALLOW_M  (TEE_REG_CORE1_MM_HP_UART4_ALLOW_V << TEE_REG_CORE1_MM_HP_UART4_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_UART4_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_UART4_ALLOW_S  14
/** TEE_REG_CORE1_MM_HP_PARLIO_ALLOW : R/W; bitpos: [15]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_PARLIO_ALLOW    (BIT(15))
#define TEE_REG_CORE1_MM_HP_PARLIO_ALLOW_M  (TEE_REG_CORE1_MM_HP_PARLIO_ALLOW_V << TEE_REG_CORE1_MM_HP_PARLIO_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_PARLIO_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_PARLIO_ALLOW_S  15
/** TEE_REG_CORE1_MM_HP_GPSPI2_ALLOW : R/W; bitpos: [16]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_GPSPI2_ALLOW    (BIT(16))
#define TEE_REG_CORE1_MM_HP_GPSPI2_ALLOW_M  (TEE_REG_CORE1_MM_HP_GPSPI2_ALLOW_V << TEE_REG_CORE1_MM_HP_GPSPI2_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_GPSPI2_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_GPSPI2_ALLOW_S  16
/** TEE_REG_CORE1_MM_HP_GPSPI3_ALLOW : R/W; bitpos: [17]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_GPSPI3_ALLOW    (BIT(17))
#define TEE_REG_CORE1_MM_HP_GPSPI3_ALLOW_M  (TEE_REG_CORE1_MM_HP_GPSPI3_ALLOW_V << TEE_REG_CORE1_MM_HP_GPSPI3_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_GPSPI3_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_GPSPI3_ALLOW_S  17
/** TEE_REG_CORE1_MM_HP_USBDEVICE_ALLOW : R/W; bitpos: [18]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_USBDEVICE_ALLOW    (BIT(18))
#define TEE_REG_CORE1_MM_HP_USBDEVICE_ALLOW_M  (TEE_REG_CORE1_MM_HP_USBDEVICE_ALLOW_V << TEE_REG_CORE1_MM_HP_USBDEVICE_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_USBDEVICE_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_USBDEVICE_ALLOW_S  18
/** TEE_REG_CORE1_MM_HP_LEDC_ALLOW : R/W; bitpos: [19]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_LEDC_ALLOW    (BIT(19))
#define TEE_REG_CORE1_MM_HP_LEDC_ALLOW_M  (TEE_REG_CORE1_MM_HP_LEDC_ALLOW_V << TEE_REG_CORE1_MM_HP_LEDC_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_LEDC_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_LEDC_ALLOW_S  19
/** TEE_REG_CORE1_MM_HP_ETM_ALLOW : R/W; bitpos: [21]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_ETM_ALLOW    (BIT(21))
#define TEE_REG_CORE1_MM_HP_ETM_ALLOW_M  (TEE_REG_CORE1_MM_HP_ETM_ALLOW_V << TEE_REG_CORE1_MM_HP_ETM_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_ETM_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_ETM_ALLOW_S  21
/** TEE_REG_CORE1_MM_HP_INTRMTX_ALLOW : R/W; bitpos: [22]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_INTRMTX_ALLOW    (BIT(22))
#define TEE_REG_CORE1_MM_HP_INTRMTX_ALLOW_M  (TEE_REG_CORE1_MM_HP_INTRMTX_ALLOW_V << TEE_REG_CORE1_MM_HP_INTRMTX_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_INTRMTX_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_INTRMTX_ALLOW_S  22
/** TEE_REG_CORE1_MM_HP_TWAI0_ALLOW : R/W; bitpos: [23]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_TWAI0_ALLOW    (BIT(23))
#define TEE_REG_CORE1_MM_HP_TWAI0_ALLOW_M  (TEE_REG_CORE1_MM_HP_TWAI0_ALLOW_V << TEE_REG_CORE1_MM_HP_TWAI0_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_TWAI0_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_TWAI0_ALLOW_S  23
/** TEE_REG_CORE1_MM_HP_TWAI1_ALLOW : R/W; bitpos: [24]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_TWAI1_ALLOW    (BIT(24))
#define TEE_REG_CORE1_MM_HP_TWAI1_ALLOW_M  (TEE_REG_CORE1_MM_HP_TWAI1_ALLOW_V << TEE_REG_CORE1_MM_HP_TWAI1_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_TWAI1_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_TWAI1_ALLOW_S  24
/** TEE_REG_CORE1_MM_HP_TWAI2_ALLOW : R/W; bitpos: [25]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_TWAI2_ALLOW    (BIT(25))
#define TEE_REG_CORE1_MM_HP_TWAI2_ALLOW_M  (TEE_REG_CORE1_MM_HP_TWAI2_ALLOW_V << TEE_REG_CORE1_MM_HP_TWAI2_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_TWAI2_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_TWAI2_ALLOW_S  25
/** TEE_REG_CORE1_MM_HP_I3C_MST_ALLOW : R/W; bitpos: [26]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_I3C_MST_ALLOW    (BIT(26))
#define TEE_REG_CORE1_MM_HP_I3C_MST_ALLOW_M  (TEE_REG_CORE1_MM_HP_I3C_MST_ALLOW_V << TEE_REG_CORE1_MM_HP_I3C_MST_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_I3C_MST_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_I3C_MST_ALLOW_S  26
/** TEE_REG_CORE1_MM_HP_I3C_SLV_ALLOW : R/W; bitpos: [27]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_I3C_SLV_ALLOW    (BIT(27))
#define TEE_REG_CORE1_MM_HP_I3C_SLV_ALLOW_M  (TEE_REG_CORE1_MM_HP_I3C_SLV_ALLOW_V << TEE_REG_CORE1_MM_HP_I3C_SLV_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_I3C_SLV_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_I3C_SLV_ALLOW_S  27
/** TEE_REG_CORE1_MM_HP_LCDCAM_ALLOW : R/W; bitpos: [28]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_LCDCAM_ALLOW    (BIT(28))
#define TEE_REG_CORE1_MM_HP_LCDCAM_ALLOW_M  (TEE_REG_CORE1_MM_HP_LCDCAM_ALLOW_V << TEE_REG_CORE1_MM_HP_LCDCAM_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_LCDCAM_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_LCDCAM_ALLOW_S  28
/** TEE_REG_CORE1_MM_HP_ADC_ALLOW : R/W; bitpos: [30]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_ADC_ALLOW    (BIT(30))
#define TEE_REG_CORE1_MM_HP_ADC_ALLOW_M  (TEE_REG_CORE1_MM_HP_ADC_ALLOW_V << TEE_REG_CORE1_MM_HP_ADC_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_ADC_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_ADC_ALLOW_S  30
/** TEE_REG_CORE1_MM_HP_UHCI_ALLOW : R/W; bitpos: [31]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_UHCI_ALLOW    (BIT(31))
#define TEE_REG_CORE1_MM_HP_UHCI_ALLOW_M  (TEE_REG_CORE1_MM_HP_UHCI_ALLOW_V << TEE_REG_CORE1_MM_HP_UHCI_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_UHCI_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_UHCI_ALLOW_S  31

/** TEE_CORE1_MM_PMS_REG3_REG register
 *  NA
 */
#define TEE_CORE1_MM_PMS_REG3_REG (DR_REG_TEE_BASE + 0x34)
/** TEE_REG_CORE1_MM_HP_GPIO_ALLOW : R/W; bitpos: [0]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_GPIO_ALLOW    (BIT(0))
#define TEE_REG_CORE1_MM_HP_GPIO_ALLOW_M  (TEE_REG_CORE1_MM_HP_GPIO_ALLOW_V << TEE_REG_CORE1_MM_HP_GPIO_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_GPIO_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_GPIO_ALLOW_S  0
/** TEE_REG_CORE1_MM_HP_IOMUX_ALLOW : R/W; bitpos: [1]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_IOMUX_ALLOW    (BIT(1))
#define TEE_REG_CORE1_MM_HP_IOMUX_ALLOW_M  (TEE_REG_CORE1_MM_HP_IOMUX_ALLOW_V << TEE_REG_CORE1_MM_HP_IOMUX_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_IOMUX_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_IOMUX_ALLOW_S  1
/** TEE_REG_CORE1_MM_HP_SYSTIMER_ALLOW : R/W; bitpos: [2]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_SYSTIMER_ALLOW    (BIT(2))
#define TEE_REG_CORE1_MM_HP_SYSTIMER_ALLOW_M  (TEE_REG_CORE1_MM_HP_SYSTIMER_ALLOW_V << TEE_REG_CORE1_MM_HP_SYSTIMER_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_SYSTIMER_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_SYSTIMER_ALLOW_S  2
/** TEE_REG_CORE1_MM_HP_SYS_REG_ALLOW : R/W; bitpos: [3]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_SYS_REG_ALLOW    (BIT(3))
#define TEE_REG_CORE1_MM_HP_SYS_REG_ALLOW_M  (TEE_REG_CORE1_MM_HP_SYS_REG_ALLOW_V << TEE_REG_CORE1_MM_HP_SYS_REG_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_SYS_REG_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_SYS_REG_ALLOW_S  3
/** TEE_REG_CORE1_MM_HP_CLKRST_ALLOW : R/W; bitpos: [4]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_MM_HP_CLKRST_ALLOW    (BIT(4))
#define TEE_REG_CORE1_MM_HP_CLKRST_ALLOW_M  (TEE_REG_CORE1_MM_HP_CLKRST_ALLOW_V << TEE_REG_CORE1_MM_HP_CLKRST_ALLOW_S)
#define TEE_REG_CORE1_MM_HP_CLKRST_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_MM_HP_CLKRST_ALLOW_S  4

/** TEE_CORE1_UM_PMS_REG0_REG register
 *  NA
 */
#define TEE_CORE1_UM_PMS_REG0_REG (DR_REG_TEE_BASE + 0x38)
/** TEE_REG_CORE1_UM_PSRAM_ALLOW : R/W; bitpos: [0]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_UM_PSRAM_ALLOW    (BIT(0))
#define TEE_REG_CORE1_UM_PSRAM_ALLOW_M  (TEE_REG_CORE1_UM_PSRAM_ALLOW_V << TEE_REG_CORE1_UM_PSRAM_ALLOW_S)
#define TEE_REG_CORE1_UM_PSRAM_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_UM_PSRAM_ALLOW_S  0
/** TEE_REG_CORE1_UM_FLASH_ALLOW : R/W; bitpos: [1]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_UM_FLASH_ALLOW    (BIT(1))
#define TEE_REG_CORE1_UM_FLASH_ALLOW_M  (TEE_REG_CORE1_UM_FLASH_ALLOW_V << TEE_REG_CORE1_UM_FLASH_ALLOW_S)
#define TEE_REG_CORE1_UM_FLASH_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_UM_FLASH_ALLOW_S  1
/** TEE_REG_CORE1_UM_L2MEM_ALLOW : R/W; bitpos: [2]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_UM_L2MEM_ALLOW    (BIT(2))
#define TEE_REG_CORE1_UM_L2MEM_ALLOW_M  (TEE_REG_CORE1_UM_L2MEM_ALLOW_V << TEE_REG_CORE1_UM_L2MEM_ALLOW_S)
#define TEE_REG_CORE1_UM_L2MEM_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_UM_L2MEM_ALLOW_S  2
/** TEE_REG_CORE1_UM_L2ROM_ALLOW : R/W; bitpos: [3]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_UM_L2ROM_ALLOW    (BIT(3))
#define TEE_REG_CORE1_UM_L2ROM_ALLOW_M  (TEE_REG_CORE1_UM_L2ROM_ALLOW_V << TEE_REG_CORE1_UM_L2ROM_ALLOW_S)
#define TEE_REG_CORE1_UM_L2ROM_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_UM_L2ROM_ALLOW_S  3
/** TEE_REG_CORE1_UM_TRACE0_ALLOW : R/W; bitpos: [6]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_UM_TRACE0_ALLOW    (BIT(6))
#define TEE_REG_CORE1_UM_TRACE0_ALLOW_M  (TEE_REG_CORE1_UM_TRACE0_ALLOW_V << TEE_REG_CORE1_UM_TRACE0_ALLOW_S)
#define TEE_REG_CORE1_UM_TRACE0_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_UM_TRACE0_ALLOW_S  6
/** TEE_REG_CORE1_UM_TRACE1_ALLOW : R/W; bitpos: [7]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_UM_TRACE1_ALLOW    (BIT(7))
#define TEE_REG_CORE1_UM_TRACE1_ALLOW_M  (TEE_REG_CORE1_UM_TRACE1_ALLOW_V << TEE_REG_CORE1_UM_TRACE1_ALLOW_S)
#define TEE_REG_CORE1_UM_TRACE1_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_UM_TRACE1_ALLOW_S  7
/** TEE_REG_CORE1_UM_CPU_BUS_MON_ALLOW : R/W; bitpos: [8]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_UM_CPU_BUS_MON_ALLOW    (BIT(8))
#define TEE_REG_CORE1_UM_CPU_BUS_MON_ALLOW_M  (TEE_REG_CORE1_UM_CPU_BUS_MON_ALLOW_V << TEE_REG_CORE1_UM_CPU_BUS_MON_ALLOW_S)
#define TEE_REG_CORE1_UM_CPU_BUS_MON_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_UM_CPU_BUS_MON_ALLOW_S  8
/** TEE_REG_CORE1_UM_L2MEM_MON_ALLOW : R/W; bitpos: [9]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_UM_L2MEM_MON_ALLOW    (BIT(9))
#define TEE_REG_CORE1_UM_L2MEM_MON_ALLOW_M  (TEE_REG_CORE1_UM_L2MEM_MON_ALLOW_V << TEE_REG_CORE1_UM_L2MEM_MON_ALLOW_S)
#define TEE_REG_CORE1_UM_L2MEM_MON_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_UM_L2MEM_MON_ALLOW_S  9
/** TEE_REG_CORE1_UM_TCM_MON_ALLOW : R/W; bitpos: [10]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_UM_TCM_MON_ALLOW    (BIT(10))
#define TEE_REG_CORE1_UM_TCM_MON_ALLOW_M  (TEE_REG_CORE1_UM_TCM_MON_ALLOW_V << TEE_REG_CORE1_UM_TCM_MON_ALLOW_S)
#define TEE_REG_CORE1_UM_TCM_MON_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_UM_TCM_MON_ALLOW_S  10
/** TEE_REG_CORE1_UM_CACHE_ALLOW : R/W; bitpos: [11]; default: 1;
 *  NA
 */
#define TEE_REG_CORE1_UM_CACHE_ALLOW    (BIT(11))
#define TEE_REG_CORE1_UM_CACHE_ALLOW_M  (TEE_REG_CORE1_UM_CACHE_ALLOW_V << TEE_REG_CORE1_UM_CACHE_ALLOW_S)
#define TEE_REG_CORE1_UM_CACHE_ALLOW_V  0x00000001U
#define TEE_REG_CORE1_UM_CACHE_ALLOW_S  11

